app/Controllers/Admin/CancionesController.php

SELECT *
FROM `tbl_cat_genero`
WHERE `genero_Activo` = 1
ORDER BY `genero_Nombre` ASC
---
    public function create()
    {
        $db = \Config\Database::connect();

        $generos = $db->table('tbl_cat_genero')
            ->where('genero_Activo', 1)
            ->orderBy('genero_Nombre', 'ASC')
            ->get()
            ->getResult();

INSERT INTO `tbl_rel_music_genero` (`music_Id`, `genero_Id`) VALUES (32, 8)
---
    $musicId = $model->getInsertID();

    if ($generoId > 0) {
        $db->table('tbl_rel_music_genero')->insert([
            'music_Id' => $musicId,
            'genero_Id' => $generoId
        ]);

SELECT *
FROM `tbl_cat_genero`
WHERE `genero_Activo` = 1
ORDER BY `genero_Nombre` ASC
---
        $cancion['genero_Id'] = '';
    }

    $generos = $db->table('tbl_cat_genero')
        ->where('genero_Activo', 1)
        ->orderBy('genero_Nombre', 'ASC')
        ->get()
        ->getResultArray();